<html xmlns:ng="http://docbook.org/docbook-ng"><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Snake</title><meta name="generator" content="DocBook XSL Stylesheets V1.79.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article"><div class="titlepage"><div><div><h2 class="title"><a name="d6e1"></a>Snake</h2></div><div><div class="author"><h3 class="author"><span class="firstname">&#1057;&#1090;&#1072;&#1085;&#1080;&#1089;&#1083;&#1072;&#1074;</span> <span class="surname">&#1052;&#1072;&#1088;&#1090;&#1099;&#1085;&#1077;&#1085;&#1082;&#1086;</span></h3></div></div><div><p class="copyright">Copyright &copy; 2017 &#1052;&#1072;&#1088;&#1090;&#1099;&#1085;&#1077;&#1085;&#1082;&#1086; &#1057;&#1090;&#1072;&#1085;&#1080;&#1089;&#1083;&#1072;&#1074;</p></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="section"><a href="#d6e13">&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1103; &#1079;&#1084;&#1077;&#1080;</a></span></dt><dt><span class="section"><a href="#d6e17">&#1056;&#1086;&#1089;&#1090; &#1079;&#1084;&#1077;&#1080;</a></span></dt><dt><span class="section"><a href="#d6e21">&#1055;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; &#1077;&#1076;&#1099;</a></span></dt></dl></div>
    
    <p>&#1048;&#1075;&#1088;&#1072; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1076;&#1083;&#1103; &#1083;&#1077;&#1075;&#1082;&#1086;&#1075;&#1086; &#1080; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1087;&#1088;&#1086;&#1074;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1089;&#1091;&#1075;&#1072;.</p>
    <p>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1079;&#1084;&#1077;&#1077;&#1081; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1103;&#1083;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1089;&#1090;&#1088;&#1077;&#1083;&#1086;&#1095;&#1077;&#1082; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077;.</p>
    <p>&#1048;&#1075;&#1088;&#1072; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1072; &#1085;&#1072; &#1103;&#1079;&#1099;&#1082;&#1077; JavaScript.</p>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d6e13"></a>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1103; &#1079;&#1084;&#1077;&#1080;</h2></div></div></div>
        
        <p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1080;&#1075;&#1088;&#1086;&#1082;&#1086;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077; &#1080; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1086;&#1077;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1082;&#1086;&#1085;&#1090;&#1089;&#1072;&#1085;&#1090;&#1085;&#1086;, &#1085;&#1072;&#1087;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1079;&#1084;&#1077;&#1080;. &#1047;&#1084;&#1077;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1089;&#1103; &#1074; &#1083;&#1077;&#1074;&#1086;, &#1087;&#1088;&#1072;&#1074;&#1086;, &#1074;&#1074;&#1077;&#1088;&#1093;, &#1074;&#1085;&#1080;&#1079; (LEFT, RIGHT, UP, DOWN).</p>
        <pre class="programlisting">Snake.prototype.setDirection = function(direction){
        var newX, newY;
        switch(direction){
            case LEFT:
                newX = -1;
                newY = 0;
                break;
            case RIGHT:
                newX = 1;
                newY = 0;
                break;
            case UP:
                newX = 0;
                newY = -1;
                break;
            case DOWN:
                newX = 0;
                newY = 1;
                break;
            default:
                console.error("Unknow direction" + direction);
                return;
        }
        this.newDirectionX = newX;
        this.newDirectionY = newY;
    }</pre>
    </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d6e17"></a>&#1056;&#1086;&#1089;&#1090; &#1079;&#1084;&#1077;&#1080;</h2></div></div></div>
        
        <p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1075;&#1086;&#1083;&#1086;&#1074;&#1099; &#1079;&#1084;&#1077;&#1080; (&#1085;&#1072; &#1082;&#1083;&#1077;&#1090;&#1082;&#1077; &#1089; &#1077;&#1076;&#1086;&#1081;, &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1081; &#1079;&#1084;&#1077;&#1077;, &#1085;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1081; &#1082;&#1083;&#1077;&#1090;&#1082;&#1077; &#1080;&#1075;&#1088;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103;) &#1080; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1087;&#1088;&#1086;&#1080;&#1089;&#1086;&#1076;&#1080;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077;(&#1088;&#1086;&#1089;&#1090; &#1079;&#1084;&#1077;&#1080; &#1080; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1086;&#1074;&#1086;&#1081; &#1087;&#1080;&#1097;&#1080;, &#1082;&#1086;&#1085;&#1077;&#1094; &#1080;&#1075;&#1088;&#1099;, &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080;&#1077; &#1079;&#1084;&#1077;&#1080; &#1087;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102;).</p>
        <pre class="programlisting">function onGrow(){
    snake.grow();
    var foodIndex = foodAt(snake.head.x,snake.head.y);
    if(foodIndex &gt;= 0){
        food.splice(foodIndex, 1);
        snakeLengthInc++;
        generateFood();
    }
    if(snake.contains(snake.head.x, snake.head.y, true)){
        draw();
        gameOver();
        return;
    }
    if(snakeLengthInc == 0){
        snake.shrink();
    }else{
        snakeLengthInc--;
    }
    draw();
}</pre>
    </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d6e21"></a>&#1055;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; &#1077;&#1076;&#1099;</h2></div></div></div>
        
        <p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1080; &#1077;&#1076;&#1099; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1090; &#1077;&#1077; &#1085;&#1072; &#1080;&#1075;&#1088;&#1086;&#1074;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077;.</p>
        <pre class="programlisting">function generateFood(){
    var x, y;

    do{
        x = Math.random() * GRID_WIDTH | 0;
        y = Math.random() * GRID_HEIGHT | 0;
        console.log(x, y);
    }while(snake.contains(x, y) || foodAt(x, y) &gt;= 0);
    food.push({x: x, y: y});
}</pre>
    </div>
</div></body></html>